app/controllers/entities_controller.rb

SELECT "entities".* FROM "entities" WHERE "entities"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @entity = Entity.find(params[:id])

INSERT INTO "entities" ("name", "amount", "author_id", "groupe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "New"], ["amount", "45.0"], ["author_id", 1], ["groupe_id", 1], ["created_at", "2022-05-25 05:44:56.419239"], ["updated_at", "2022-05-25 05:44:56.419239"]]
---
  def create
    @entity = current_user.entities.new(entity_params)
    if @entity.save